In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30),
                   ('Page', 'bar', 80.34),
                   ('Tompkins', 'bar', 34.2),
                   ('Als Place', 'Restaurant', 56.52),],
           columns=('name', 'type', 'AvgBill')
                 )
df

             name        type  AvgBill
0  Foreign Cinema  Restaurant   289.00
1       Liho Liho  Restaurant   224.00
2        500 Club         bar    80.50
3      The Square         bar    25.30
4            Page         bar    80.34
5        Tompkins         bar    34.20
6       Als Place  Restaurant    56.52

In [6]:
df.sample(n = 2)

       name type  AvgBill
2  500 Club  bar    80.50
4      Page  bar    80.34

## The sample method tries to extract the n number of rows from the original data "randomly"